# Задайте последовательность чисел. 
# Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.


a = [1, 3, 4, 5, 5, 6, 7, 8, 9, 9]

b = set(a)

print(b)
